In [59]:
import numpy as np
import pandas as pd

In [60]:
sozluk1={"isim":["ahmet","mehmet","zeynep","atıl"],
        "spor":["koşu","yüzme","koşu","basketbol"],
        "kalori":[100,200,300,400]
        }

In [61]:
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [62]:
dataFrame1

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yüzme     200
2  zeynep       koşu     300
3    atıl  basketbol     400

In [63]:
sozluk2={"isim":["osman","levent","atlas","fatma"],
        "spor":["koşu","yüzme","koşu","basketbol"],
        "kalori":[200,100,50,300]
        }

In [64]:
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6,7])

In [65]:
sozluk3={"isim":["ayse","mahmut","duygu","nur"],
        "spor":["koşu","yüzme","badminton","tenis"],
        "kalori":[300,400,500,250]
        }

In [66]:
dataFrame3=pd.DataFrame(sozluk3,index=[8,9,10,11])

In [67]:
dataFrame3

      isim       spor  kalori
8     ayse       koşu     300
9   mahmut      yüzme     400
10   duygu  badminton     500
11     nur      tenis     250

### concatenation

In [68]:
pd.concat([dataFrame1,dataFrame2,dataFrame3])

      isim       spor  kalori
0    ahmet       koşu     100
1   mehmet      yüzme     200
2   zeynep       koşu     300
3     atıl  basketbol     400
4    osman       koşu     200
5   levent      yüzme     100
6    atlas       koşu      50
7    fatma  basketbol     300
8     ayse       koşu     300
9   mahmut      yüzme     400
10   duygu  badminton     500
11     nur      tenis     250

In [69]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

      isim       spor  kalori
0    ahmet       koşu     100
1   mehmet      yüzme     200
2   zeynep       koşu     300
3     atıl  basketbol     400
4    osman       koşu     200
5   levent      yüzme     100
6    atlas       koşu      50
7    fatma  basketbol     300
8     ayse       koşu     300
9   mahmut      yüzme     400
10   duygu  badminton     500
11     nur      tenis     250

### merge

In [70]:
mergeSozluk1={"isim":["ahmet","mehmet","zeynep","atıl"],
        "spor":["koşu","yüzme","koşu","basketbol"],
        
        }

In [71]:
mergeDataFrame1=pd.DataFrame(mergeSozluk1)

In [72]:
mergeDataFrame1

     isim       spor
0   ahmet       koşu
1  mehmet      yüzme
2  zeynep       koşu
3    atıl  basketbol

In [73]:
mergeSozluk2={"isim":["ahmet","mehmet","zeynep","atıl"],
         "kalori":[100,200,150,250]
        }

In [74]:
mergeDataFrame2=pd.DataFrame(mergeSozluk2)

In [75]:
mergeDataFrame2

     isim  kalori
0   ahmet     100
1  mehmet     200
2  zeynep     150
3    atıl     250

In [76]:
pd.merge(mergeDataFrame1,mergeDataFrame2)

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yüzme     200
2  zeynep       koşu     150
3    atıl  basketbol     250

In [77]:
maasSozluk={"isim":["atıl","zeynep","mehmet","ahmet"],
           "departman":["yazılım","satış","pazarlama","yazılım"],
           "maas":[200,300,400,500]
           }

In [78]:
maasDataFrame=pd.DataFrame(maasSozluk)

In [79]:
maasDataFrame

     isim  departman  maas
0    atıl    yazılım   200
1  zeynep      satış   300
2  mehmet  pazarlama   400
3   ahmet    yazılım   500

In [80]:
maasDataFrame["departman"].unique()

array(['yazılım', 'satış', 'pazarlama'], dtype=object)

In [81]:
maasDataFrame["departman"].nunique()

3

In [82]:
maasDataFrame["departman"].value_counts()

departman
yazılım      2
satış        1
pazarlama    1
Name: count, dtype: int64

In [83]:
def bruttenNete(maas):
    return  maas*0.66

In [84]:
maasDataFrame["maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: maas, dtype: float64

.apply() ile kolayca fonskiyonları uygulayabildik.

In [85]:
maasDataFrame.isnull()

    isim  departman   maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

null değer var mı diye kontrol ettik.

In [86]:
yeniVeri={"karakter sınıfı":["south park","south park","simpson","simpson"],
         "karakter ismi":["cartman","kenny","homer","bart"],
         "karakter yası":[9,10,50,20]
         }

In [87]:
karakterDF=pd.DataFrame(yeniVeri)

In [88]:
karakterDF

  karakter sınıfı karakter ismi  karakter yası
0      south park       cartman              9
1      south park         kenny             10
2         simpson         homer             50
3         simpson          bart             20

In [89]:
karakterDF.pivot_table(values="karakter yası",index=["karakter sınıfı","karakter ismi"])

                               karakter yası
karakter sınıfı karakter ismi
simpson         bart                      20
                homer                     50
south park      cartman                    9
                kenny                     10

pivot_table excel de kullanılan özelliktir.Multi index de yaptıklarımızı bir farklı yöntemle pivot table kullanarak yaptık

In [92]:
yeniVeri={"karakter sınıfı":["south park","south park","simpson","simpson","simpson"],
         "karakter ismi":["cartman","kenny","homer","bart","bart"],
         "karakter yası":[9,10,50,20,10]
         }

In [94]:
karakterDF=pd.DataFrame(yeniVeri)

In [95]:
karakterDF

  karakter sınıfı karakter ismi  karakter yası
0      south park       cartman              9
1      south park         kenny             10
2         simpson         homer             50
3         simpson          bart             20
4         simpson          bart             10

In [96]:
karakterDF.pivot_table(values="karakter yası",index=["karakter sınıfı","karakter ismi"])

                               karakter yası
karakter sınıfı karakter ismi
simpson         bart                      15
                homer                     50
south park      cartman                    9
                kenny                     10

bart için 20 ile 10 un ort aldı,istersem ort aldırırabiliriz istersek de toplatabiliriz
;

In [97]:
karakterDF.pivot_table(values="karakter yası",index=["karakter sınıfı","karakter ismi"],aggfunc=np.sum)

                               karakter yası
karakter sınıfı karakter ismi
simpson         bart                      30
                homer                     50
south park      cartman                    9
                kenny                     10